test/one_particle_sediment_Re280_IB/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}

convertToMeters 0.0008;

/*
vertices
(
  (0 0 0)   // 0
  (8 0 0)   // 1
  (12 0 0)  // 2
  (20 0 0)  // 3

  (0 8 0)   // 4
  (8 8 0)   // 5
  (12 8 0)  // 6
  (20 8 0)  // 7

  (0 12 0)   // 8
  (8 12 0)   // 9
  (12 12 0)  // 10
  (20 12 0)  // 11

  (0 20 0)   // 12
  (8 20 0)   // 13
  (12 20 0)  // 14
  (20 20 0)  // 15


  (0 0 80)   // 16
  (8 0 80)   // 17
  (12 0 80)  // 18
  (20 0 80)  // 19

  (0 8 80)   // 20
  (8 8 80)   // 21
  (12 8 80)  // 22
  (20 8 80)  // 23

  (0 12 80)   // 24
  (8 12 80)   // 25
  (12 12 80)  // 26
  (20 12 80)  // 27

  (0 20 80)   // 28
  (8 20 80)   // 29
  (12 20 80)  // 30
  (20 20 80)  // 31
);
*/

vertices
(
  (0 0 0)   // 0
  (4 0 0)   // 1
  (6 0 0)   // 2
  (10 0 0)  // 3

  (0 4 0)   // 4
  (4 4 0)   // 5
  (6 4 0)   // 6
  (10 4 0)  // 7

  (0 6 0)   // 8
  (4 6 0)   // 9
  (6 6 0)   // 10
  (10 6 0)  // 11

  (0 10 0)   // 12
  (4 10 0)   // 13
  (6 10 0)   // 14
  (10 10 0)  // 15

  (0 0 132)   // 16
  (4 0 132)   // 17
  (6 0 132)   // 18
  (10 0 132)  // 19

  (0 4 132)   // 20
  (4 4 132)   // 21
  (6 4 132)   // 22
  (10 4 132)  // 23

  (0 6 132)   // 24
  (4 6 132)   // 25
  (6 6 132)   // 26
  (10 6 132)  // 27

  (0 10 132)   // 28
  (4 10 132)   // 29
  (6 10 132)   // 30
  (10 10 132)  // 31
);

blocks
(
  hex (0 1 5 4 16 17 21 20) (6 6 480) edgeGrading (0.5 0.5 1)  // 0
  hex (1 2 6 5 17 18 22 21) (8 6 480) edgeGrading (1 0.5 1)    // 1
  hex (2 3 7 6 18 19 23 22) (6 6 480) edgeGrading (2 0.5 1)    // 2
  hex (4 5 9 8 20 21 25 24) (6 8 480) edgeGrading (0.5 1 1)    // 3
  hex (5 6 10 9 21 22 26 25) (8 8 480) simpleGrading (1 1 1)   // 4 (centre)
  hex (6 7 11 10 22 23 27 26) (6 8 480) edgeGrading (2 1 1)    // 5
  hex (8 9 13 12 24 25 29 28) (6 6 480) edgeGrading (0.5 2 1)  // 6
  hex (9 10 14 13 25 26 30 29) (8 6 480) edgeGrading (1 2 1)   // 7
  hex (10 11 15 14 26 27 31 30) (6 6 480) edgeGrading (2 2 1)  // 8
);

edges
(
);

patches
(
  wall inlet
  (
    (0 1 5 4)
    (1 2 6 5)
    (2 3 7 6)
    (4 5 9 8)
    (5 6 10 9)
    (6 7 11 10)
    (8 9 13 12)
    (9 10 14 13)
    (10 11 15 14)
  )
  wall wall
  (
    (0 16 20 4)
    (4 20 24 8)
    (8 24 28 12)
    (12 28 29 13)
    (13 29 30 14)
    (14 30 31 15)
    (15 31 27 11)
    (11 27 23 7)
    (7 23 19 3)
    (3 19 18 2)
    (2 18 17 1)
    (1 17 16 0)
  )
  wall outlet
  (
    (16 17 21 20)
    (17 18 22 21)
    (18 19 23 22)
    (20 21 25 24)
    (21 22 26 25)
    (22 23 27 26)
    (24 25 29 28)
    (25 26 30 29)
    (26 27 31 30)
  )
  /*
  empty frontAndBack
  (
  )
  */
);

mergePatchPairs
(
);
